dreplogle/EE-345M/boards/ek-lm3s8962/drivers/OS.c
//*****************************************************************************
//
// Filename: OS.c
// Authors: Dustin Replogle, Katy Loeffler   
// Initial Creation Date: February 3, 2011 
// Description: This file includes functions for managing the operating system, such
// as adding periodic tasks.    
// Lab Number. 01    
// TA: Raffaele Cetrulo      
// Date of last revision: February 9, 2011 (for style modifications)      
// Hardware Configuration: default
//
// Modules used:
//		1. GPTimers:
//			a. GPTimer3 is used for periodic tasks (see OS_AddPeriodicThread)
//			b. GPTimer1 is like a general TCNT
//			c. GPTimer0 is used for ADC triggering (see ADC_Collect)
//      2. SysTick: The period of the SysTick is used to dictate the TIMESLICE
//		   for thread switching.  Systick handler causes thread switch.
//		3. ADC: all 4 channels may be accessed.
//		4. UART: UART0 is used for communication with a console.
//
//*****************************************************************************


#include "inc/hw_ints.h"
#include "inc/hw_memmap.h"
#include "inc/hw_types.h"
#include "inc/hw_nvic.h"
#include "driverlib/timer.h"
#include "driverlib/interrupt.h"
#include "driverlib/sysctl.h"
#include "driverlib/gpio.h"
#include "driverlib/systick.h"
#include "driverlib/fifo.h"
#include "driverlib/adc.h"
#include "drivers/OS.h"
#include "drivers/rit128x96x4.h"
#include "string.h"

//***********************************************************************
//
// For setting interrupts
//
//***********************************************************************
#define NVIC_PRI11_REG (*((volatile unsigned long *)(0xE000E42C)))	//#46 GPIOF	  Reg:(44-47)
#define NVIC_PRI12_REG (*((volatile unsigned long *)(0xE000E430)))  //#51 Timer3A Reg:(48-51)
#define OS_ENTERCRITICAL(){sr = SRSave(); timeIoff = OS_Time();}
#define OS_EXITCRITICAL(){TimeIbitDisabled += OS_TimeDifference(OS_Time(),timeIoff); SRRestore(sr);}
//***********************************************************************
// 
// Global Variables
//
//***********************************************************************

//***********************************************************************
// For Periodic Tasks
//***********************************************************************
void(*PeriodicTaskA)(void);
void(*PeriodicTaskB)(void);
unsigned char TimerAFree;
unsigned char TimerBFree;
Sema4Type PeriodicTimerMutex;

unsigned long const JitterSize=JITTERSIZE;
unsigned long JitterHistogramA[JITTERSIZE]={0,};
unsigned long JitterHistogramB[JITTERSIZE]={0,};
long MaxJitterA;             // largest time jitter between interrupts in usec
long MinJitterA;             // smallest time jitter between interrupts in usec
long MaxJitterB;             // largest time jitter between interrupts in usec
long MinJitterB;             // smallest time jitter between interrupts in usec
unsigned long PeriodTimerA;
unsigned long PeriodTimerB;

// For Lab3.c
long MaxJitter;    // largest time difference between interrupt trigger and running thread
long MinJitter;    // smallest time difference between interrupt trigger and running thread
unsigned long JitterHistogram[];

// Following code copied from game logic 
//*****************************************************************************
//
// The debounced state of the five push buttons.  The bit positions correspond
// to:
//
//     0 - Up
//     1 - Down
//     2 - Left
//     3 - Right
//     4 - Select
//
//*****************************************************************************
unsigned char g_ucSwitches = 0x1f;

//*****************************************************************************
//
// The vertical counter used to debounce the push buttons.  The bit positions
// are the same as g_ucSwitches.
//
//*****************************************************************************
static unsigned char g_ucSwitchClockA = 0;
static unsigned char g_ucSwitchClockB = 0;

//*****************************************************************************
//
// Handles the SysTick timeout interrupt.
//
//*****************************************************************************

//***********************************************************************
// For Button Tasks
//***********************************************************************
void(*ButtonTask)(void) = NULL;
void(*DownTask)(void) = NULL;
void(*UpTask)(void) = NULL;
void(*LeftTask)(void) = NULL;
void(*RightTask)(void) = NULL;
//***********************************************************************
// For Thread Switcher
//***********************************************************************
TCB * CurrentThread;     //pointer to the current thread
TCB * NextThread;		 //pointer to the next thread to run
TCB * Sleeper;			 //pointer to a sleeping thread
TCB * ThreadList;		 //pointer to the beginning of the circular linked list of TCBs
struct tcb OSThreads[MAX_NUM_OS_THREADS];  //pointers to all the threads in the OS
unsigned char ThreadStacks[MAX_NUM_OS_THREADS][STACK_SIZE];

//***********************************************************************
// Miscellaneous
//***********************************************************************
unsigned long MailBox1;
unsigned long TimeIbitDisabled;

//***********************************************************************
// OS_Fifo variables, this code segment copied from Valvano, lecture1
//***********************************************************************
typedef unsigned long dataType;
dataType volatile *PutPt; // put next
dataType volatile *GetPt; // get next
dataType static Fifo[MAX_OS_FIFOSIZE];
unsigned long FifoSize;

//***********************************************************************
//
// Function prototypes for internal functions
//
//***********************************************************************
int PerThreadSwitchInit(unsigned long period);
unsigned char * StackInit(unsigned char * ThreadStkPtr, void(*task)(void));
void SwitchThreads(void);
void LaunchInternal(unsigned char * firstStackPtr);
void TriggerPendSV(void);
long SRSave (void);
void SRRestore(long sr);

//***********************************************************************
//
// OS_Init initializes the array of TCBs, diables interrupts
//
// \param none.
// \return none.
//
//***********************************************************************
void
OS_Init(void)
{
  int threadNum;
  IntMasterDisable();

  // Set the clocking to run from PLL at 50 MHz 
  SysCtlClockSet(SYSCTL_SYSDIV_4 | SYSCTL_USE_PLL | SYSCTL_OSC_MAIN | SYSCTL_XTAL_8MHZ);
  
