dreplogle/EE-345M/boards/ek-lm3s8962/drivers/OS.c
  // Disable GPIO PortF module
  //SysCtlPeripheralDisable(SYSCTL_PERIPH_GPIOE);

  // Disable interrupts associated with the switch
  GPIOPinIntDisable(GPIO_PORTE_BASE, GPIO_PIN_1);
  
  GPIOPinIntClear(GPIO_PORTE_BASE, GPIO_PIN_1);
  IntDisable(INT_GPIOE); 
  
  return SUCCESS;

}

//***********************************************************************
//
// OS_AddPeriodicThread 
//
// \param task is a pointer to the function to be executed at a periodic rate
// \param period is the period to be loaded to timer register
// \param priority is the priority of the task to be used in the NVIC
//
// \return the numerical ID for the periodic thread. Error code FAIL returned
// if \param priority is out of acceptable range.
//
//***********************************************************************
int 
OS_AddPeriodicThread(void(*task)(void), unsigned long period, unsigned long priority)
{
  //Enter critical 
  long sr = 0;
  unsigned long timeIoff;
  OS_ENTERCRITICAL();

  //Check for timer availiability
  OS_bWait(&PeriodicTimerMutex);
  if(TimerAFree){
    TimerAFree = 0;  //False
	OS_bSignal(&PeriodicTimerMutex);
	PeriodicTaskA = task;
    SysCtlPeripheralEnable(SYSCTL_PERIPH_TIMER3);
	TimerDisable(TIMER3_BASE, TIMER_A);
    // Set the global timer configuration.
    HWREG(TIMER3_BASE + 0x00000000) = (TIMER_CFG_16_BIT_PAIR|TIMER_CFG_A_PERIODIC) >> 24;
    // Set the configuration of the A and B timers.  Note that the B timer
    // configuration is ignored by the hardware in 32-bit modes.
    HWREG(TIMER3_BASE + 0x00000004) = (TIMER_CFG_16_BIT_PAIR|TIMER_CFG_A_PERIODIC) & 255;
    TimerLoadSet(TIMER3_BASE, TIMER_A, period);
	PeriodTimerA = period;
    TimerIntEnable(TIMER3_BASE, TIMER_TIMA_TIMEOUT);
    TimerIntClear(TIMER3_BASE, TIMER_TIMA_TIMEOUT);
    IntEnable(INT_TIMER3A);                                                                                
    if(priority < 8){
      IntPrioritySet(INT_TIMER3A,(((unsigned char)priority)<<5)&0xF0);
    }
    else{
       IntMasterEnable();
	   return FAIL; 
    }
    TimerEnable(TIMER3_BASE, TIMER_A);
	//Exit critical 
    IntMasterEnable();
	return SUCCESS;
  }
  else if(TimerBFree){
    TimerBFree = 0;  //False
	OS_bSignal(&PeriodicTimerMutex);
	PeriodicTaskB = task;
	TimerDisable(TIMER3_BASE, TIMER_B);
    // Set the global timer configuration.
    HWREG(TIMER3_BASE + 0x00000000) = (TIMER_CFG_16_BIT_PAIR|TIMER_CFG_B_PERIODIC) >> 24;
    // Set the configuration of the A and B timers.  Note that the B timer
    // configuration is ignored by the hardware in 32-bit modes.
    HWREG(TIMER3_BASE + 0x00000008) = ((TIMER_CFG_16_BIT_PAIR|TIMER_CFG_B_PERIODIC)>> 8) & 255;
    TimerLoadSet(TIMER3_BASE, TIMER_B, period);
	PeriodTimerB = period;
    TimerIntEnable(TIMER3_BASE, TIMER_TIMB_TIMEOUT);
    TimerIntClear(TIMER3_BASE, TIMER_TIMB_TIMEOUT);
    IntEnable(INT_TIMER3B);                                                                                
    if(priority < 8){
      IntPrioritySet(INT_TIMER3B,(((unsigned char)priority)<<5)&0xF0);
    }
    else{
       IntMasterEnable();
	   return FAIL; 
    }
    TimerEnable(TIMER3_BASE, TIMER_B);
	//Exit critical 
    IntMasterEnable();
	return SUCCESS;
  }
  
  OS_bSignal(&PeriodicTimerMutex);
  //Exit critical 
  OS_EXITCRITICAL();
  return FAIL;
}

//***********************************************************************
//
// OS_Launch starts the OS on the first thread in the circular linked list
// of threads.
//
// \param period is the timeslice of the OS, the execution time share for 
// each thread.
//
// \retun none.
//
//***********************************************************************
void
OS_Launch(unsigned long period)
{
  //The first thread is the one at the beginning of the list
  CurrentThread = ThreadList;
  PerThreadSwitchInit(period);
  LaunchInternal(CurrentThread->stackPtr);  //doesn't return  
}

//***********************************************************************
//
// OS_Sleep puts a thread to sleep for a given number of milliseconds
//
//***********************************************************************
void
OS_Sleep(unsigned long sleepCount)
{
  // Put the thread to sleep by loading a value into the sleep counter
  CurrentThread->sleepCount = sleepCount;

  // Pass control to the next thread
  TriggerPendSV();  
}

//***********************************************************************
//
//  OS_Suspend causes control to be passed to the next thread in the 
//  list without the allotted timeslice timing out.
//
// \param none.
// \return none.
//
//***********************************************************************
void
OS_Suspend(void)
{
  TriggerPendSV();  
}

//***********************************************************************
//
// OS_Kill removes the current thread from the linked list.  This 
// function does not change the CurrentThread pointer so that the
// current thread can finish and the next thread switch will be
// correct.
//
// \param none.
// \return none. 
//
//***********************************************************************
void 
OS_Kill(void)
{
  // Start the search pointer at the beginning of the list
  TCB * searchPtr = ThreadList;

  // Search the list and find the thread that points to the
  // one to be removed.
  while((searchPtr->next) != CurrentThread)
  {
    searchPtr = searchPtr->next;
  }

  // Remove the current thread from the linked list by assigning
  // the pointer of the previous thread to the thread ahead of the
  // element to be removed. 
  searchPtr->next = CurrentThread->next;

  // Indicate to AddThread that this spot is open
  CurrentThread->id = DEAD;

  // Move on to the next thread
  TriggerPendSV();

  // Wait for the PendSV to take effect (very short)
  while(1);
}

//***********************************************************************
//
// OS_Id
//
//***********************************************************************
unsigned char
OS_Id(void)
{
  return CurrentThread->id;
}

//***********************************************************************
//
// OS_Fifo_Init
//
//***********************************************************************
void
OS_Fifo_Init(unsigned int size)
{
  long sr = 0;
  unsigned long timeIoff;
  OS_ENTERCRITICAL();

  PutPt = GetPt = &Fifo[0];
  FifoSize = size;

  OS_EXITCRITICAL();  
}

//***********************************************************************
//
// OS_Fifo_Get
//
//***********************************************************************
unsigned int
OS_Fifo_Get(unsigned long * dataPtr)
{
  if(PutPt == GetPt ){
    return FAIL;// Empty if PutPt=GetPt
  }
  else{
  *dataPtr = *(GetPt++);
    if(GetPt==&Fifo[FifoSize]){
      GetPt = &Fifo[0]; // wrap
    }
    return SUCCESS;
  }
}

//***********************************************************************
//
// OS_Fifo_Put
//
//***********************************************************************
unsigned int
OS_Fifo_Put(unsigned long data)
{
  dataType volatile *nextPutPt;
  nextPutPt = PutPt+1;
  if(nextPutPt ==&Fifo[FifoSize]){
    nextPutPt = &Fifo[0]; // wrap
  }
  if(nextPutPt == GetPt){
    return FAIL; // Failed, fifo full
  }
  else{
    *(PutPt) = data; // Put
    PutPt = nextPutPt; // Success, update
    return SUCCESS;
  }
}

//***********************************************************************
//
// OS_MailBox_Init
//
//***********************************************************************
void
OS_MailBox_Init(void)
{
  MailBox1 = 0;
}

//***********************************************************************
//
// OS_MailBox_Send
//
//***********************************************************************
void
OS_MailBox_Send(unsigned long data)
{
  MailBox1 = data;
}

//***********************************************************************
//
// OS_MailBox_Recv
//
//***********************************************************************
unsigned long
OS_MailBox_Recv(void)
{
  return MailBox1;
}

//***********************************************************************
//
// OS_MsTime
//
// \param none
//
// This function returns the current value of the SysTick timer used to 
// switch threads.
//
// \return counter value.
//
//***********************************************************************
unsigned long OS_Time(void)
{
  return TimerValueGet(TIMER1_BASE, TIMER_A);
}

//***********************************************************************
//
// OS_TimeDifference returns the time difference in usec.
//
//***********************************************************************
long OS_TimeDifference(unsigned long time1, unsigned long time2)
{
  if(time2 >= time1)
  {
  	return (long)(time2-time1);
  }
  else
  {
    return (long)(time2 + (MAX_TCNT-time1));      
  } 
}
//***********************************************************************
//
// OS_DebugProfileInit initializes GPIO port B pins 0 and 1 for time profiling
//
// \param none.
// \return none.
//
//***********************************************************************
void
OS_DebugProfileInit(void)
{
  SysCtlPeripheralEnable(SYSCTL_PERIPH_GPIOB);
  GPIOPinTypeGPIOOutput(GPIO_PORTB_BASE, GPIO_PIN_0 | GPIO_PIN_1 | GPIO_PIN_2 | GPIO_PIN_3);  
}

//***********************************************************************
//
// OS_DebugB0Set sets PortB0 to 1
//
// \param none.
// \return none.
//
//***********************************************************************
void
OS_DebugB0Set(void)
{
  GPIOPinWrite(GPIO_PORTB_BASE, GPIO_PIN_0, 1);
}
void
OS_DebugB1Set(void)
{
  GPIOPinWrite(GPIO_PORTB_BASE, GPIO_PIN_1, 1);
}

//***********************************************************************
//
// OS_DebugB0Clear sets PortB0 to 0
//
// \param none.
// \return none.
//
//***********************************************************************
void
OS_DebugB0Clear(void)
{
  GPIOPinWrite(GPIO_PORTB_BASE, GPIO_PIN_0, 0);
}
void
OS_DebugB1Clear(void)
{
  GPIOPinWrite(GPIO_PORTB_BASE, GPIO_PIN_1, 0);
}


//***********************************************************************
//
//  OS_InitSemaphore initializes semaphore within the OS to a given 
//  value.
//
// /param
//
//***********************************************************************

void 
OS_InitSemaphore(Sema4Type *semaPt, unsigned int value)
{
  long sr = 0;
  unsigned long timeIoff;
  OS_ENTERCRITICAL();

