dreplogle/EE-345M/boards/ek-lm3s8962/drivers/OS.c
  (semaPt->value) = value;

  OS_EXITCRITICAL();
}

//***********************************************************************
//
//   OS_Signal signals a given semaphore.
//
//***********************************************************************

void 
OS_Signal(Sema4Type *semaPt)
{
  TCB * temp = ThreadList;  // pointer to all threads in the threadlist
  TCB * toUnblock;          // pointer to thread to unblock
  unsigned long highest_priority = 100; 
  long sr = 0;
  unsigned long timeIoff;
  OS_ENTERCRITICAL();
  (semaPt->value)++;
  if((semaPt->value) <= 0)
  {
     do
     {
       if(((temp->BlockPt) == semaPt) && (temp->priority < highest_priority)) 
       {
         toUnblock = temp;   // If a thread is blocked by this semaphore and 
                             // is the highest priority, unblock the thread
         highest_priority = toUnblock->priority;
       }
       temp = temp->next;
     }
     while(temp != ThreadList);
     if(toUnblock->BlockPt != NULL)
     {
       toUnblock->BlockPt = NULL;
     }
  }
  OS_EXITCRITICAL();
}

//***********************************************************************
//
//   OS_Wait waits for a given semaphore.
//
//***********************************************************************

void 
OS_Wait(Sema4Type *semaPt)
{
  IntMasterDisable();
  (semaPt->value)--;
  if((semaPt->value) < 0)
  {
     CurrentThread->BlockPt = semaPt;
     OS_Suspend();
  }
  IntMasterEnable();
}

//***********************************************************************
//
//   OS_bSignal signals binary semaphore. 
//
//***********************************************************************

void 
OS_bSignal(Sema4Type *semaPt)
{
//  IntMasterDisable();
  (semaPt->value) = 1;
//  IntMasterEnable();
}

//***********************************************************************
//
//   OS_bSignal waits for binary semaphore.
//
//***********************************************************************

void 
OS_bWait(Sema4Type *semaPt)
{
  IntMasterDisable();
  while((semaPt->value) == 0)
  {
  	IntMasterEnable();

  	IntMasterDisable();
  }
  (semaPt->value) = 0;
  IntMasterEnable();
}

//***********************************************************************
//
// PerThreadSwitchInit initializes the SysTick timer to interrupt at the 
// specified period to perform thread switching
//
// \param period is the period at which threads will be swtiched
// 
// \return SUCCESS if function was successful and FAIL if period 
// paramter is out of range.
//
//***********************************************************************
int 
PerThreadSwitchInit(unsigned long period)
{
  // Enable SysTick Interrupts
  SysTickIntEnable();

  // Set the period in ms
  SysTickPeriodSet(period);

  // Set Systick priority to high, PendSV priority to low
  IntPrioritySet(FAULT_SYSTICK,(((unsigned char)0)<<5)&0xF0);
  IntPrioritySet(FAULT_PENDSV,(((unsigned char)7)<<5)&0xF0);
  
  // Enable the SysTick module  
  SysTickEnable();

  return SUCCESS;
}

//***********************************************************************
//
// Timer 3A Interrupt handler, executes the user defined period task.
//
//***********************************************************************
void
Timer3AIntHandler(void)
{
  static unsigned long LastTime;  // time at previous ADC sample  
  unsigned long thisTime;         // time at current ADC sample
  long jitter;                    // time between measured and expected
  int index;

  // Jitter calculation:
  thisTime = OS_Time();       // current time, 20 ns
  jitter = ((OS_TimeDifference(thisTime,LastTime)-PeriodTimerA)*CLOCK_PERIOD)/1000;  // in usec
  if(jitter > MaxJitterA){
    MaxJitterA = jitter;
  }
  if(jitter < MinJitterA){
    MinJitterA = jitter;
  }        // jitter should be 0
  index = jitter+JITTERSIZE/2;   // us units
  if(index<0)index = 0;
  if(index>=JitterSize)index = JITTERSIZE-1;
  JitterHistogramA[index]++; 
  LastTime = thisTime; 

  // Execute the periodic thread
  TimerIntClear(TIMER3_BASE, TIMER_TIMA_TIMEOUT);
  PeriodicTaskA();  
}

//***********************************************************************
//
// Timer 3B Interrupt handler, executes the user defined period task.
//
//***********************************************************************
void
Timer3BIntHandler(void)
{
  static unsigned long LastTime;  // time at previous ADC sample  
  unsigned long thisTime;         // time at current ADC sample
  long jitter;                    // time between measured and expected
  int index;

  // Jitter calculation:
  thisTime = OS_Time();       // current time, 20 ns
  jitter = ((OS_TimeDifference(thisTime,LastTime)-PeriodTimerB)*CLOCK_PERIOD)/1000;  // in usec
  if(jitter > MaxJitterB){
    MaxJitterB = jitter;
  }
  if(jitter < MinJitterB){
    MinJitterB = jitter;
  }        // jitter should be 0
  index = jitter+JITTERSIZE/2;   // us units
  if(index<0)index = 0;
  if(index>=JitterSize)index = JITTERSIZE-1;
  JitterHistogramB[index]++; 
  LastTime = thisTime;

  // Execute Periodic task
  TimerIntClear(TIMER3_BASE, TIMER_TIMB_TIMEOUT);
  PeriodicTaskB();  
}

//***********************************************************************
//
// Timer 2A Interrupt handler, executes the user defined period task.
//
//***********************************************************************
void
Timer2IntHandler(void)
{
  unsigned long ulData, ulDelta; 
  IntMasterDisable();

    //
    // Read the state of the push buttons.
    //
    ulData = (GPIOPinRead(GPIO_PORTE_BASE, (GPIO_PIN_0 | GPIO_PIN_1 |
                                            GPIO_PIN_2 | GPIO_PIN_3)) |
              (GPIOPinRead(GPIO_PORTF_BASE, GPIO_PIN_1) << 3));

    //
    // Determine the switches that are at a different state than the debounced
    // state.
    //
    ulDelta = ulData ^ g_ucSwitches;

    //
    // Increment the clocks by one.
    //
    g_ucSwitchClockA ^= g_ucSwitchClockB;
    g_ucSwitchClockB = ~g_ucSwitchClockB;

    //
    // Reset the clocks corresponding to switches that have not changed state.
    //
    g_ucSwitchClockA &= ulDelta;
    g_ucSwitchClockB &= ulDelta;

    //
    // Get the new debounced switch state.
    //
    g_ucSwitches &= g_ucSwitchClockA | g_ucSwitchClockB;
    g_ucSwitches |= (~(g_ucSwitchClockA | g_ucSwitchClockB)) & ulData;

    //
    // Determine the switches that just changed debounced state.
    //
    ulDelta ^= (g_ucSwitchClockA | g_ucSwitchClockB);
  
  //If the button is still pressed, execute the user task.
  if((ulDelta & 0x10) && !(g_ucSwitches & 0x10))
  {
    ButtonTask();
  }
  if((ulDelta & 0x08) && !(g_ucSwitches & 0x08))
  {
    RightTask();
  }
  if((ulDelta & 0x04) && !(g_ucSwitches & 0x04))
  {
    LeftTask();
  }
  if((ulDelta & 0x02) && !(g_ucSwitches & 0x02))
  {
    DownTask();
  }
  if((ulDelta & 0x01) && !(g_ucSwitches & 0x01))
  {
    UpTask();
  }
  //Wait for the user to release the button
  //while(GPIOPinRead(GPIO_PORTF_BASE, GPIO_PIN_1));
  
  //Debounce for 10ms
  //SysCtlDelay((SysCtlClockGet()/1000)*10);

