dreplogle/EE-345M/boards/ek-lm3s8962/drivers/OS.c
  //Re-read switch to make sure it is unpressed.
  //while(GPIOPinRead(GPIO_PORTF_BASE, GPIO_PIN_1));

  //Clear the interrupt
  /*GPIOPinIntClear(GPIO_PORTF_BASE, GPIO_PIN_1);
  GPIOPinIntClear(GPIO_PORTE_BASE, GPIO_PIN_1);
  GPIOPinIntClear(GPIO_PORTE_BASE, GPIO_PIN_1);
  GPIOPinIntClear(GPIO_PORTE_BASE, GPIO_PIN_1);
  GPIOPinIntClear(GPIO_PORTE_BASE, GPIO_PIN_1);*/


  TimerIntClear(TIMER2_BASE, TIMER_TIMA_TIMEOUT);
  //GPIOPinIntEnable(GPIO_PORTF_BASE, GPIO_PIN_1);

  IntMasterEnable();  
}

//***********************************************************************
//
// SysTick handler, enables PendSV for thread switching.
//
//***********************************************************************

void
SysTickThSwIntHandler(void)
{   
  unsigned long ulData, ulDelta; 
  IntMasterDisable();

    //
    // Read the state of the push buttons.
    //
    ulData = (GPIOPinRead(GPIO_PORTE_BASE, (GPIO_PIN_0 | GPIO_PIN_1 |
                                            GPIO_PIN_2 | GPIO_PIN_3)) |
              (GPIOPinRead(GPIO_PORTF_BASE, GPIO_PIN_1) << 3));

    //
    // Determine the switches that are at a different state than the debounced
    // state.
    //
    ulDelta = ulData ^ g_ucSwitches;

    //
    // Increment the clocks by one.
    //
    g_ucSwitchClockA ^= g_ucSwitchClockB;
    g_ucSwitchClockB = ~g_ucSwitchClockB;

    //
    // Reset the clocks corresponding to switches that have not changed state.
    //
    g_ucSwitchClockA &= ulDelta;
    g_ucSwitchClockB &= ulDelta;

    //
    // Get the new debounced switch state.
    //
    g_ucSwitches &= g_ucSwitchClockA | g_ucSwitchClockB;
    g_ucSwitches |= (~(g_ucSwitchClockA | g_ucSwitchClockB)) & ulData;

    //
    // Determine the switches that just changed debounced state.
    //
    ulDelta ^= (g_ucSwitchClockA | g_ucSwitchClockB);
  
  //If the button is still pressed, execute the user task.
  if((ulDelta & 0x10) && !(g_ucSwitches & 0x10) && (ButtonTask != NULL))
  {
    ButtonTask();
  }
  if((ulDelta & 0x08) && !(g_ucSwitches & 0x08) && (RightTask != NULL))
  {
    RightTask();
  }
  if((ulDelta & 0x04) && !(g_ucSwitches & 0x04) && (LeftTask != NULL))
  {
    LeftTask();
  }
  if((ulDelta & 0x02) && !(g_ucSwitches & 0x02) && (DownTask != NULL))
  {
    DownTask();
  }
  if((ulDelta & 0x01) && !(g_ucSwitches & 0x01) && (UpTask != NULL))
  {
    UpTask();
  }
  //Wait for the user to release the button
  //while(GPIOPinRead(GPIO_PORTF_BASE, GPIO_PIN_1));
  
  //Debounce for 10ms
  //SysCtlDelay((SysCtlClockGet()/1000)*10);

  //Re-read switch to make sure it is unpressed.
  //while(GPIOPinRead(GPIO_PORTF_BASE, GPIO_PIN_1));

  //Clear the interrupt
  /*GPIOPinIntClear(GPIO_PORTF_BASE, GPIO_PIN_1);
  GPIOPinIntClear(GPIO_PORTE_BASE, GPIO_PIN_1);
  GPIOPinIntClear(GPIO_PORTE_BASE, GPIO_PIN_1);
  GPIOPinIntClear(GPIO_PORTE_BASE, GPIO_PIN_1);
  GPIOPinIntClear(GPIO_PORTE_BASE, GPIO_PIN_1);*/


  //TimerIntClear(TIMER2_BASE, TIMER_TIMA_TIMEOUT);
  //GPIOPinIntEnable(GPIO_PORTF_BASE, GPIO_PIN_1);

  IntMasterEnable();  
  
  TriggerPendSV();
}

//***********************************************************************
//
// PendSV handler, switches threads.  Disables interrupts during execution.
//
//***********************************************************************
void 
PendSVHandler(void)
{
  TCB * TempPt;
  static unsigned long RunPriorityLevel;

  //Determine the priority level to run	and update sleeping threads
  RunPriorityLevel = 100;     //Initialize to rediculously low priority
  TempPt = ThreadList;
  do
  {
    // Find lowest active priority level
    if((TempPt->BlockPt == NULL)&&(TempPt->priority < RunPriorityLevel)&&(TempPt->sleepCount == 0))
	  {
        RunPriorityLevel = TempPt->priority;
	  }
	  // Decrement sleep counter on sleeping threads
    if(TempPt->sleepCount > 0)
	  {
      (TempPt->sleepCount)--;
	  }
	  TempPt = TempPt->next;
  }while(TempPt != ThreadList);


  // Find the next thread that is not...
  // (1) Sleeping
  // (2) Blocked or
  // (3) Too low in priority
  NextThread = CurrentThread->next;
  while((NextThread->sleepCount != 0)||(NextThread->BlockPt != NULL)||(NextThread->priority > RunPriorityLevel))
  {
    NextThread = NextThread->next;
  }
  SwitchThreads();
  HWREG(NVIC_ST_CURRENT) = 0;
}

//***********************************************************************
//
// Select switch interrupt handler.  Executes task set by OS_AddButtonTask.
//
//***********************************************************************
void
SwitchIntHandler(void)
{
  //
  // Enable Timer2 module
  //
  SysCtlPeripheralEnable(SYSCTL_PERIPH_TIMER2);

  //
  // Configure Timer2 as a 32-bit one-shot timer.
  //
  TimerConfigure(TIMER2_BASE, TIMER_CFG_32_BIT_OS);

  //
  // Set the Timer2 load value to generate the period specified by the user.
  //
  // 1000 at 50Mhz = 20us
  TimerLoadSet(TIMER2_BASE, TIMER_BOTH, 100000);

  //
  // Enable the Timer2 interrupt.
  //
  TimerIntEnable(TIMER2_BASE, TIMER_TIMA_TIMEOUT);
  TimerIntClear(TIMER2_BASE, TIMER_TIMA_TIMEOUT);
  IntEnable(INT_TIMER2A);                                                                                
  //
  // Start Timer2.
  //
  TimerEnable(TIMER2_BASE, TIMER_BOTH);
  /*GPIOPinIntDisable(GPIO_PORTF_BASE, GPIO_PIN_1);
  GPIOPinIntDisable(GPIO_PORTE_BASE, GPIO_PIN_0);
  GPIOPinIntDisable(GPIO_PORTE_BASE, GPIO_PIN_1);
  GPIOPinIntDisable(GPIO_PORTE_BASE, GPIO_PIN_2);
  GPIOPinIntDisable(GPIO_PORTE_BASE, GPIO_PIN_3);*/
}
 
//******************************EOF**************************************




